console.log("Задача 5");
console.log("Даны переменные a и b. Отнимите от a переменную b и результат присвойте переменной c.");
console.log("Сделайте так, чтобы в любом случае в переменную c записалось положительное значение.");
console.log("Проверьте работу скрипта при a и b, равных соответственно 3 и 5, 6 и 1.");
console.log("==== РЕШЕНИЕ ===================================================================");

let a = 3;
let b = 5;

let c = Math.abs(a - b);

console.log(c);





console.log("");
console.log("");
