console.log("Задача 10");
console.log("Дано произвольное целое число n. Написать программу, которая:");
console.log("a. разбивает число n на цифры и выводит их на экран;");
console.log("b. подсчитывает сколько цифр в числе n;");
console.log("c. находит сумму цифр числа n;");
console.log("d. меняет порядок цифр числа n на обратный.");
console.log("Пример: вводится число 123: цифр в числе = 3; сумма = 6; обратный порядок 321.");
console.log("==================================================================");



let nUm = prompt("Введите число");
let coUn = 0,
    sUm = 0,
    rev = "";

for (let i = 0; i < nUm.length; i++) {
    // console.log(num[i]);
    coUn++;
    sUm += +nUm[i];
    rev = nUm[i] + rev;
}
console.log(`Исходное число: ${nUm}
  Сумма цифр: ${sUm}
  Количество цифр: ${coUn}
  Число в обратном порядке: ${rev}`);

console.log("");
console.log("");
