console.log("Задача 7");
console.log("Дано число n=1000. Делите его на 2 столько раз, пока результат деления не станет");
console.log("меньше 50. Какое число получится? Посчитайте количество итераций, необходимых");
console.log("для этого (итерация - это проход цикла), и запишите его в переменную num.");
console.log("==================================================================================");

let n = 1000;
let num = 0;

while (n >= 50) {
    n /= 2;
    num++;
}

console.log(`Число ${n}. Количество итераций: ${num}.`);


console.log("");
console.log("");
