console.log("Задача 8");
console.log("Запустите цикл, в котором пользователю предлагается вводить число с клавиатуры, до");
console.log("тех пор, пока не будет введена пустая строка или 0. После выхода из цикла выведите");
console.log("общую сумму и среднее арифметическое введённых чисел. Если пользователь ввел не");
console.log("число, то вывести сообщение об ошибке ввода. При подсчете учесть, что пользователь");
console.log("может ввести отрицательное значение.");
console.log("=====================================================================================");

let input;
let sum1 = 0;
let count = 0;

while (true) {
    input = prompt("Введите число:");

    if (input === "" || input === "0") break;

    let num = parseFloat(input);

    if (isNaN(num)) {
        console.log("Ошибка ввода! Попробуйте еще раз.");
        continue;
    }

    sum1 += num;
    count++;
}

if (count > 0) {
    let avg = sum1 / count;
    console.log(`Сумма введенных чисел: ${sum}`);
    console.log(`Среднее арифметическое введенных чисел: ${avg}`);
} else {
    console.log("Вы не ввели ни одного числа.");
}


console.log("");
console.log("");