
console.log("Задача 2");
console.log("Дан массив с числами [-2, -1, -3, 15, 0, -4, 2, -5, 9, -15, 0, 4, 5, -6, 10, 7].");
console.log("Числа могутбыть положительными и отрицательными.");
console.log("Выведите на экран только отрицательныечисла,");
console.log("которые больше -10, но меньше -3.");
console.log("======================================================================================");

let _arr = [-2, -1, -3, 15, 0, -4, 2, -5, 9, -15, 0, 4, 5, -6, 10, 7];
let result = _arr.filter((num) => num > -10 && num < -3);
console.log(result);


console.log("");
console.log("");
