let _name = prompt("Введите ваше имя", "Надежда"),
     age = prompt("Введите ваш возраст", 41),
     city = prompt("Введите город вашего проживания", "Минск"),
     phone = prompt("Введите ваш номер телефона", "+375292648475"),
     email = prompt("Введите вашу электронную почту", "i.ciganio@gmail.com"),
     company = prompt("Введите название компании в которой вы работаете", "ЗАО-Интернет маазин Евроопт");

document.write(
    "Меня зовут " +
        _name +
        ". Мне " +
        age +
        " год. Я живу в городе " +
        city +
        "," +
        "и работаю в компании " +
        company +
        ". Мои контактные данные: " +
        phone +
        ", " +
        email +
        "."
);